# DATAFRAME

Tener pandas en version 1

In [2]:
import numpy as np
import pandas as pd
pd.__version__

'1.3.4'

## Convertir Diccionario en Dataframe

In [3]:
dict_data = {
    'edad' :     [ 10, 9, 13, 14, 12, 11, 12],
    'cm' : [ 115, 110, 130, 155, 125, 120, 125],
    'pais' :    [ 'co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch'],
    'genero' :  [ 'M', 'F', 'F', 'M', 'M', 'M', 'F'],
    'Q1' : [ 5, 10, 8, np.nan, 7, 8, 3],
    'Q2' : [ 7, 9, 9, 8, 8, 8, 9.]
}
dict_data

{'edad': [10, 9, 13, 14, 12, 11, 12],
 'cm': [115, 110, 130, 155, 125, 120, 125],
 'pais': ['co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch'],
 'genero': ['M', 'F', 'F', 'M', 'M', 'M', 'F'],
 'Q1': [5, 10, 8, nan, 7, 8, 3],
 'Q2': [7, 9, 9, 8, 8, 8, 9.0]}

In [4]:
df = pd.DataFrame(dict_data, index = ['ana','benito','camilo','daniel','erika','fabian','gabriela'])
df

          edad   cm pais genero    Q1   Q2
ana         10  115   co      M   5.0  7.0
benito       9  110   mx      F  10.0  9.0
camilo      13  130   co      F   8.0  9.0
daniel      14  155   mx      M   NaN  8.0
erika       12  125   mx      M   7.0  8.0
fabian      11  120   ch      M   8.0  8.0
gabriela    12  125   ch      F   3.0  9.0

## Metodos b√°sicos

In [20]:
df.head()

        edad   cm pais genero    Q1   Q2
ana       10  115   co      M   5.0  7.0
benito     9  110   mx      F  10.0  9.0
camilo    13  130   co      F   8.0  9.0
daniel    14  155   mx      M   NaN  8.0
erika     12  125   mx      M   7.0  8.0

In [19]:
df.describe()

            edad          cm         Q1        Q2
count   7.000000    7.000000   6.000000  7.000000
mean   11.571429  125.714286   6.833333  8.285714
std     1.718249   14.556949   2.483277  0.755929
min     9.000000  110.000000   3.000000  7.000000
25%    10.500000  117.500000   5.500000  8.000000
50%    12.000000  125.000000   7.500000  8.000000
75%    12.500000  127.500000   8.000000  9.000000
max    14.000000  155.000000  10.000000  9.000000

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, ana to gabriela
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   edad    7 non-null      int64
 1   cm      7 non-null      int64
 2   pais    7 non-null      object
 3   genero  7 non-null      object
 4   Q1      6 non-null      float64
 5   Q2      7 non-null      float64
dtypes: float64(2), int64(2), object(2)
memory usage: 692.0+ bytes

## Atributos b√°sicos

In [17]:
df.columns

Index(['edad', 'cm', 'pais', 'genero', 'Q1', 'Q2'], dtype='object')

In [22]:
df.dtypes

edad        int64
cm          int64
pais       object
genero     object
Q1        float64
Q2        float64
dtype: object

In [26]:
df.shape

(7, 6)

# How do I select a subset of a DataFrame?

## Seleccionar columnas espec√≠ficas

Each column in a DataFrame is a Series.

When selecting a single column of a pandas DataFrame, the result is a pandas Series.

In [6]:
df['edad']

<class 'pandas.core.series.Series'>

ana         10
benito       9
camilo      13
daniel      14
erika       12
fabian      11
gabriela    12
Name: edad, dtype: int64

In [24]:
print(type(df['edad']))

<class 'pandas.core.series.Series'>

In [7]:
df[['edad','cm','Q1']]

          edad   cm    Q1
ana         10  115   5.0
benito       9  110  10.0
camilo      13  130   8.0
daniel      14  155   NaN
erika       12  125   7.0
fabian      11  120   8.0
gabriela    12  125   3.0

In [27]:
type(df[['edad','cm','Q1']])

pandas.core.frame.DataFrame

## Seleccionar filas espec√≠ficas

In [12]:
df['edad'] >= 12

ana         False
benito      False
camilo       True
daniel       True
erika        True
fabian      False
gabriela     True
Name: edad, dtype: bool

In [13]:
df[df['edad'] >= 12]

          edad   cm pais genero   Q1   Q2
camilo      13  130   co      F  8.0  9.0
daniel      14  155   mx      M  NaN  8.0
erika       12  125   mx      M  7.0  8.0
gabriela    12  125   ch      F  3.0  9.0

You can not use or/and but need to use the or operator | and the and operator &.

In [14]:
df[ (df['edad'] >= 12) & (df['pais'] == 'mx')]

        edad   cm pais genero   Q1   Q2
daniel    14  155   mx      M  NaN  8.0
erika     12  125   mx      M  7.0  8.0

In [29]:
df[df['pais'].isin(['mx','co'])]

        edad   cm pais genero    Q1   Q2
ana       10  115   co      M   5.0  7.0
benito     9  110   mx      F  10.0  9.0
camilo    13  130   co      F   8.0  9.0
daniel    14  155   mx      M   NaN  8.0
erika     12  125   mx      M   7.0  8.0

A partir de consultas

In [42]:
df.query('edad > 12')

        edad   cm pais genero   Q1   Q2
camilo    13  130   co      F  8.0  9.0
daniel    14  155   mx      M  NaN  8.0

## Seleccionar columnas y filas espec√≠ficas

Usando los nombres de columnas y filas

In [8]:
df.loc['daniel','Q2']

8.0

In [10]:
df.loc[['ana','erika'], ['edad','cm','Q1'] ]

       edad   cm   Q1
ana      10  115  5.0
erika    12  125  7.0

In [31]:
df.loc[df['edad']>12, 'pais']

camilo    co
daniel    mx
Name: pais, dtype: object

In [38]:
df.loc['ana':'camilo', 'cm':'genero']

         cm pais genero
ana     115   co      M
benito  110   mx      F
camilo  130   co      F

Usando los n√∫meros de columnas y filas

In [9]:
df.iloc[3,5]

8.0

In [11]:
df.iloc[[0,5],[0,1,4]]

        edad   cm   Q1
ana       10  115  5.0
fabian    11  120  8.0

In [41]:
df.iloc[2:5, :3]

        edad   cm pais
camilo    13  130   co
daniel    14  155   mx
erika     12  125   mx

When selecting specific rows and/or columns with loc or iloc, new values can be assigned to the selected data